package com.mioopp;

import com.mioopp.util.ArrayUtil;
import java.io.InputStream;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

/**
 * @author mioopp
 * @create 2021-01-18 15:39
 */
public interface Constant {

  int spaceX = 35;

  int spaceY = 36;

  int pointStartX = 5;

  int pointStartY = 19;

  //车价值
  int[][] c = {
      {206, 208, 207, 213, 214, 213, 207, 208, 206},
      {206, 212, 209, 216, 233, 216, 209, 212, 206},
      {206, 208, 207, 214, 216, 214, 207, 208, 206},
      {206, 213, 213, 216, 216, 216, 213, 213, 206},
      {208, 211, 211, 214, 215, 214, 211, 211, 208},

      {208, 212, 212, 214, 215, 214, 212, 212, 208},
      {204, 209, 204, 212, 214, 212, 204, 209, 204},
      {198, 208, 204, 212, 212, 212, 204, 208, 198},
      {200, 208, 206, 212, 200, 212, 206, 208, 200},
      {194, 206, 204, 212, 200, 212, 204, 206, 194}
  };

  //马价值
  int[][] m = {
      {90, 90, 90, 96, 90, 96, 90, 90, 90},
      {90, 96, 103, 97, 94, 97, 103, 96, 90},
      {92, 98, 99, 103, 99, 103, 99, 98, 92},
      {93, 108, 100, 107, 100, 107, 100, 108, 93},
      {90, 100, 99, 103, 104, 103, 99, 100, 90},

      {90, 98, 101, 102, 103, 102, 101, 98, 90},
      {92, 94, 98, 95, 98, 95, 98, 94, 92},
      {93, 92, 94, 95, 92, 95, 94, 92, 93},
      {85, 90, 92, 93, 78, 93, 92, 90, 85},
      {88, 85, 90, 88, 90, 88, 90, 85, 88}
  };

  //相价值
  int[][] x = {
      {0, 0, 20, 0, 0, 0, 20, 0, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 0, 0, 23, 0, 0, 0, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 20, 0, 0, 0, 20, 0, 0},

      {0, 0, 20, 0, 0, 0, 20, 0, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {18, 0, 0, 0, 23, 0, 0, 0, 18},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 20, 0, 0, 0, 20, 0, 0}
  };

  //士价值
  int[][] s = {
      {0, 0, 0, 20, 0, 20, 0, 0, 0},
      {0, 0, 0, 0, 23, 0, 0, 0, 0},
      {0, 0, 0, 20, 0, 20, 0, 0, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},

      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 0, 20, 0, 20, 0, 0, 0},
      {0, 0, 0, 0, 23, 0, 0, 0, 0},
      {0, 0, 0, 20, 0, 20, 0, 0, 0}
  };

  //奖价值
  int[][] j = {
      {0, 0, 0, 8888, 8888, 8888, 0, 0, 0},
      {0, 0, 0, 8888, 8888, 8888, 0, 0, 0},
      {0, 0, 0, 8888, 8888, 8888, 0, 0, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},

      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 0, 8888, 8888, 8888, 0, 0, 0},
      {0, 0, 0, 8888, 8888, 8888, 0, 0, 0},
      {0, 0, 0, 8888, 8888, 8888, 0, 0, 0}
  };

  //炮价值
  int[][] p = {

      {100, 100, 96, 91, 90, 91, 96, 100, 100},
      {98, 98, 96, 92, 89, 92, 96, 98, 98},
      {97, 97, 96, 91, 92, 91, 96, 97, 97},
      {96, 99, 99, 98, 100, 98, 99, 99, 96},
      {96, 96, 96, 96, 100, 96, 96, 96, 96},

      {95, 96, 99, 96, 100, 96, 99, 96, 95},
      {96, 96, 96, 96, 96, 96, 96, 96, 96},
      {97, 96, 100, 99, 101, 99, 100, 96, 97},
      {96, 97, 98, 98, 98, 98, 98, 97, 96},
      {96, 96, 97, 99, 99, 99, 97, 96, 96}
  };

  //卒价值
  int[][] z = {
      {9, 9, 9, 11, 13, 11, 9, 9, 9},
      {19, 24, 34, 42, 44, 42, 34, 24, 19},
      {19, 24, 32, 37, 37, 37, 32, 24, 19},
      {19, 23, 27, 29, 30, 29, 27, 23, 19},
      {14, 18, 20, 27, 29, 27, 20, 18, 14},

      {7, 0, 13, 0, 16, 0, 13, 0, 7},
      {7, 0, 7, 0, 15, 0, 7, 0, 7},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0},
      {0, 0, 0, 0, 0, 0, 0, 0, 0}
  };


  int[][] C = ArrayUtil.arrayCloneAndReverse(c);
  int[][] M = ArrayUtil.arrayCloneAndReverse(m);
  int[][] X = x;
  int[][] S = s;
  int[][] J = j;
  int[][] P = ArrayUtil.arrayCloneAndReverse(p);
  int[][] Z = ArrayUtil.arrayCloneAndReverse(z);


  Map<String, ChessInfo> chesses = new HashMap() {
    {
      put("c", new ChessInfo("车", "r_c", 1, "c", c));
      put("m", new ChessInfo("马", "r_m", 1, "m", m));
      put("x", new ChessInfo("相", "r_x", 1, "x", x));
      put("s", new ChessInfo("仕", "r_s", 1, "s", s));
      put("j", new ChessInfo("将", "r_j", 1, "j", j));
      put("p", new ChessInfo("炮", "r_p", 1, "p", p));
      put("z", new ChessInfo("兵", "r_z", 1, "b", z));

      put("C", new ChessInfo("車", "r_c", 1, "C", C));
      put("M", new ChessInfo("馬", "r_m", 1, "M", M));
      put("X", new ChessInfo("象", "r_x", 1, "X", X));
      put("S", new ChessInfo("士", "r_s", 1, "S", S));
      put("J", new ChessInfo("帅", "r_j", 1, "J", J));
      put("P", new ChessInfo("炮", "r_p", 1, "P", P));
      put("Z", new ChessInfo("卒", "r_z", 1, "Z", Z));
    }
  };

  String[][] initMap = {
      {"C0", "M0", "X0", "S0", "J0", "S1", "X1", "M1", "C1"},
      {null, null, null, null, null, null, null, null, null},
      {null, "P0", null, null, null, null, null, "P1", null},
      {"Z0", null, "Z1", null, "Z2", null, "Z3", null, "Z4"},
      {null, null, null, null, null, null, null, null, null},
      {null, null, null, null, null, null, null, null, null},
      {"z0", null, "z1", null, "z2", null, "z3", null, "z4"},
      {null, "p0", null, null, null, null, null, "p1", null},
      {null, null, null, null, null, null, null, null, null},
      {"c0", "m0", "x0", "s0", "j0", "s1", "x1", "m1", "c1"}
  };

  List<ChessObject> chessObjects = new ArrayList<>();

  default InputStream getImage(String url) {
    return this.getClass().getResourceAsStream(url);
  }
}
